#+STARTUP: overview
** Org-agenda in roam
#+begin_src emacs-lisp
(after! org
  (defun aragaer/add-to-agenda-maybe ()
    (unless (member (buffer-file-name) (org-agenda-files))
      (org-agenda-file-to-front)))

  (defun aragaer/remove-from-agenda-maybe (&optional filename)
    (let ((filename (or filename (buffer-file-name))))
      (if (member filename (org-agenda-files))
          (org-remove-file filename))))

  (defun aragaer/get-filetags ()
    (split-string (or (cadr (assoc "FILETAGS"
                                   (org-collect-keywords '("filetags"))))
                      "")
                  ":" 'omit-nulls))

  (defun aragaer/project-update-tag ()
    "Update PROJECT tag in the current buffer."
    (let ((tags (aragaer/get-filetags)))
      (if (vulpea-project-p)
          (unless (member "project" tags)
            (org-roam-tag-add '("project")))
        (when (member "project" tags)
          (org-roam-tag-remove '("project"))))))

  (defun aragaer/update-agenda ()
    "Add or remove roam file to agenda."
    (when (and (not (active-minibuffer-window))
               (fboundp 'org-roam-buffer-p)
               (org-roam-buffer-p))
      (save-excursion
        (goto-char (point-min))
        (aragaer/project-update-tag)
        (let ((tags (aragaer/get-filetags)))
          (if (or (member "agenda" tags)
                  (member "project" tags))
              (aragaer/add-to-agenda-maybe)
            (aragaer/remove-from-agenda-maybe))))))

    (add-hook 'find-file-hook #'aragaer/update-agenda)
    (add-hook 'before-save-hook #'aragaer/update-agenda)
    )
#+end_src

#+RESULTS:
| aragaer/update-agenda |

